# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть


n = int(input('Введите общее количество монет: '))
m = 0
for i in range(n):
    v = int(input('Введите позицию монеты (решкой - 1; гербом - 0): '))
    if v == 1:
        m += 1
print(f"Минимальное количество монет, которые необходимо перевернуть: {m if m<n/2 else n-m}")
